[
  {
    "id": "andersen",
    "name": ["Andersen", "Hans Christian"],
    "desc": "Although a prolific writer of plays, travelogues, novels, and poems, Andersen is best remembered for his fairy tales. Andersen's popularity is not limited to children; his stories, called eventyr in Danish, express themes that transcend age and nationality.",
    "dates": "April 2 1805 – August 4 1875"
  }
]
[
  {
    "name": ["Aesop"],
    "id": "aesop",
    "desc": "Much has been said of Aesop which cannot be detailed here."
  },
  {
    "name": ["Andersen", "Hans Christian"],
    "id": "andersen",
    "desc": "Hans Christian Andersen was born in the town of Odense, Denmark, on 2 April 1805. He was an only child. Andersen's father, also Hans, considered himself related to nobility. His paternal grandmother had told his father that their family had in the past belonged to a higher social class, but investigations prove these stories unfounded. A persistent theory suggests that Andersen was an illegitimate son of King Christian VIII, but this theory has been criticized by others."
  },
  {
    "name": "Charles",
    "lname": "Dickens",
    "desc": "Much has been said of Dickens which cannot be detailed here.",
    "id": "dickens"
  },
  {
    "name": "Emily",
    "lname": "Dickinson",
    "id": "dickinson",
    "desc": "Much has been said of Emily which cannot be detailed here."
  },
  {
    "name": "Robert",
    "lname": "Frost",
    "id": "frost",
    "desc": "Much has been said of Frost which cannot be detailed here."
  },
  {
    "name": "The Brothers",
    "lname": "Grimm",
    "id": "grimm",
    "desc": "Much has been said of the Grimm brothers which cannot be detailed here."
  },
  {
    "name": "Franz",
    "lname": "Kafka",
    "id": "kafka",
    "desc": "Much has been said of Kafka which cannot be detailed here."
  },
  {
    "name": "Rudyard",
    "lname": "Kipling",
    "id": "kipling",
    "desc": "Much has been said of Rudyard which cannot be detailed here."
  },
  {
    "name": "Henry Wadsworth",
    "lname": "Longfellow",
    "id": "longfellow",
    "desc": "Much has been said of Mr. Longfellow which cannot be detailed here."
  },
  {
    "name": "",
    "lname": "O. Henry",
    "id": "ohenry",
    "desc": "Much has been said of O. Henry which cannot be detailed here."
  },
  {
    "name": "Edgar Allan",
    "lname": "Poe",
    "desc": "Much has been said of Mr. Poe which cannot be detailed here.",
    "id": "poe"
  },
  {
    "name": "William",
    "lname": "Shakespeare",
    "desc": "Much has been said of Shakespeare which cannot be detailed here.",
    "id": "shakespeare"
  },
  {
    "name": "Henry David",
    "lname": "Thoreau",
    "desc": "Much has been said of Thoreau which cannot be detailed here.",
    "id": "thoreau"
  },
  {
    "name": "Mark",
    "lname": "Twain",
    "desc": "Much has been said of Mark Twain which cannot be detailed here.",
    "id": "twain"
  },
  {
    "name": "Oscar",
    "lname": "Wilde",
    "desc": "Much has been said of Oscar which cannot be detailed here.",
    "id": "wilde"
  }
]
